.config/doom/config.el
(setq user-full-name "Evan Riley"
      user-real-login-name "Evan Riley"
      user-login-name "evan"
      user-mail-address (rot13 "rina@rinaevyrl.pbz"))

(setq auth-sources '("~/.authinfo.gpg")
      auth-source-cache-expiry nil)

(setq-default custom-file (expand-file-name ".custom.el" doom-private-dir))
(when (file-exists-p custom-file)
  (load custom-file))

;; Performance
(setq gcmh-idle-delay 10
      gcmh-high-cons-threshold (* 512 1024 1024)) ; 512MB idle GC
(setq read-process-output-max (* 4 1024 1024))
(setq process-adaptive-read-buffering nil)
(setq inhibit-compacting-font-caches t)

;; Behavior
(setq-default
 delete-by-moving-to-trash t
 window-combination-resize t
 x-stretch-cursor t)

(setq undo-limit 80000000
      evil-want-fine-undo t
      auto-save-default t
      create-lockfiles nil
      display-time-default-load-average nil)

(display-time-mode 1)
(global-subword-mode 1)

(setq doom-theme 'doom-earl-grey)

(setq doom-font (font-spec :family "Berkeley Mono" :size 14)
      doom-big-font (font-spec :family "Berkeley Mono" :size 24)
      doom-variable-pitch-font (font-spec :family "Overpass" :size 24)
      doom-symbol-font (font-spec :family "JuliaMono" :size 14)
      doom-emoji-font (font-spec :family "Twitter Color Emoji")
      doom-serif-font (font-spec :family "IBM Plex Mono" :size 22 :weight 'light))

(defun modeline-contitional-buffer-encoding ()
  "Hide \"LF UTF-8\" in modeline."
  (setq-local doom-modeline-buffer-encoding
              (unless (and (memq (plist-get (coding-system-plist buffer-file-coding-system) :category)
                                 '(coding-category-undecided coding-category-utf-8))
                           (not (memq (coding-system-eol-type buffer-file-coding-system) '(1 2))))
                t)))
(add-hook 'after-change-major-mode-hook #'modeline-contitional-buffer-encoding)

(setq doom-modeline-enable-word-count nil
      doom-modeline-continuous-word-count-modes nil
      doom-modeline-checker-simple-format t)

(setq frame-title-format
      '(""
        (:eval
         (if (string-match-p (regexp-quote (or (bound-and-true-p org-roam-directory) "\u0000"))
                             (or buffer-file-name ""))
             (replace-regexp-in-string
              ".*/[0-9]*-?" "☰ "
              (subst-char-in-string ?_ ?\s buffer-file-name))
           "%b"))
        (:eval
         (when-let ((project-name (and (featurep 'projectile) (projectile-project-name))))
           (unless (string= "-" project-name)
             (format (if (buffer-modified-p)  " ◉ %s" "  ●  %s") project-name))))))

(use-package! ultra-scroll
  :init
  (setq scroll-conservatively 101
        scroll-margin 0)
  :config
  (ultra-scroll-mode 1))

(setq visible-bell t)

(add-hook 'before-save-hook #'whitespace-cleanup)
(setq-default sentence-end-double-space nil)
(setq-default indent-tabs-mode nil)
(add-hook 'prog-mode-hook (lambda () (setq indent-tabs-mode nil)))

;; Line numbers
(setq display-line-numbers 'relative)
(setq display-line-numbers-type 'visual)

;; Fill column
(setq display-fill-column-indicator-column 80)
(add-hook 'prog-mode-hook #'display-fill-column-indicator-mode)

;; Ensure proper indentation with TAB in insert mode
(map! :i [tab] #'indent-for-tab-command
      :i "TAB" #'indent-for-tab-command)

;; Ensure Org-cycle works in Org mode
(map! :after org
      :map org-mode-map
      :n [tab] #'org-cycle
      :n "TAB" #'org-cycle)

;; Prevent minibuffer completion hijacking
(after! corfu
  (setq corfu-auto t
        corfu-auto-delay 0.2
        corfu-auto-prefix 2)
  (global-corfu-mode))

(after! magit
  (setq magit-revision-show-gravatars '("^Author:     " . "^Commit:     ")))

;; Better diffs with Delta
(use-package! magit-delta
  :after magit
  :config
  (magit-delta-mode +1))

(after! zig-mode
  (setq zig-format-on-save t))

(after! cider
  (setq cider-repl-display-help-banner nil
        cider-repl-pop-to-buffer-on-connect 'display-only))

(after! projectile
  (setq projectile-enable-caching t)
  (setq projectile-indexing-method 'alien)
  (setq projectile-files-cache-expire 604800)
  (setq projectile-project-search-path '("~/Code/Personal/" "~/Code/Work/")
        projectile-auto-discover t))

(after! lsp-mode
  (setq lsp-idle-delay 0.5)
  (setq lsp-file-watch-threshold 2000))

(add-hook! 'mu4e-view-mode-hook #'visual-line-mode)
(add-hook! 'mu4e-compose-mode-hook #'visual-line-mode)

;; Org-Msg for rich email composition
(after! org-msg
  (setq org-msg-options "html-postamble:nil H:5 num:nil ^:{} toc:nil author:nil email:nil \\n:t"
        org-msg-startup "hidestars indent inlineimages"
        org-msg-greeting-fmt "\nHi *%s*,\n\n"
        org-msg-greeting-name-limit 3
        org-msg-convert-citation t))

;; Prefer plain text over HTML in mu4e (Gnus-based viewer in mu4e 1.8+)
(with-eval-after-load 'mm-decode
  (add-to-list 'mm-discouraged-alternatives "text/html")
  (add-to-list 'mm-discouraged-alternatives "text/richtext"))

(after! mu4e
  (setq mu4e-maildir "~/.local/share/mail/"
        mu4e-get-mail-command "mbsync -a"
        mu4e-update-interval 300
        mu4e-index-update-in-background t
        mu4e-change-filenames-when-moving t
        mu4e-headers-date-format "%Y-%m-%d %H:%M"
        mu4e-headers-fields '((:date . 20)
                              (:flags . 6)
                              (:from . 22)
                              (:subject))
        mu4e-context-policy 'pick-first
        mu4e-compose-context-policy 'always-ask
        mu4e-view-prefer-html nil
        mu4e-view-html-plaintext-ratio-heuristic most-positive-fixnum)

  ;; Toggle HTML view with H
  (map! :map mu4e-view-mode-map
        "H" #'mu4e-view-toggle-html)

  (setq mu4e-bookmarks
      `((:name "Inbox"
         :query ,(format "maildir:/%s/INBOX" user-mail-address)
         :key ?i)
        (:name "Archive"
         :query ,(format "maildir:/%s/Archive" user-mail-address)
         :key ?a)
        (:name "Spam"
         :query ,(format "maildir:/%s/INBOX.spam" user-mail-address)
         :key ?s)
        (:name "Unread messages"
         :query "flag:unread AND NOT flag:trashed"
         :key ?u)
        (:name "Today's messages"
         :query "date:today..now"
         :key ?t)
        (:name "Last 7 days"
         :query "date:7d..now"
         :key ?w)
        (:name "With images"
         :query "mime:image/*"
         :key ?p)
        (:name "Flagged"
         :query "flag:flagged"
         :key ?f))))

(set-email-account! user-mail-address
  `((mu4e-sent-folder       . ,(format "/%s/Sent" user-mail-address))
    (mu4e-drafts-folder     . ,(format "/%s/Drafts" user-mail-address))
    (mu4e-trash-folder      . ,(format "/%s/Trash" user-mail-address))
    (mu4e-refile-folder     . ,(format "/%s/Archive" user-mail-address))
    (user-mail-address      . ,user-mail-address)
    (user-full-name         . "Evan Riley"))
  t)

(setq sendmail-program (executable-find "msmtp")
      send-mail-function #'sendmail-send-it
      message-sendmail-f-is-evil t
      message-sendmail-extra-arguments '("--read-envelope-from")
      message-send-mail-function #'message-send-mail-with-sendmail)

(setq epg-pinentry-mode 'loopback)

(if (string= (daemonp) "server")
    (setenv "INSIDE_EMACS" "true"))

(after! elfeed
