.config/doom/config.el
  (setq elfeed-search-filter "@1-week-ago +unread"
        elfeed-search-title-max-width 100
        elfeed-search-title-min-width 30
        elfeed-search-trailing-width 30
        elfeed-show-entry-switch #'pop-to-buffer
        elfeed-db-directory (concat doom-cache-dir "elfeed/"))

  (defun elfeed-mark-all-as-read ()
    "Mark all visible entries as read."
    (interactive)
    (mark-whole-buffer)
    (elfeed-search-untag-all-unread))

  (map! :map elfeed-search-mode-map
        :localleader
        "m" #'elfeed-mark-all-as-read
        "u" #'elfeed-update))

(use-package! elfeed-org
  :after elfeed
  :config
  (setq rmh-elfeed-org-files (list (concat org-directory "feeds.org")))
  (elfeed-org))

(add-hook! 'elfeed-search-mode-hook #'elfeed-update)

(unpin! org)
(use-package! org-contrib)
(use-package! org-roam-ui)
(use-package! org-modern)
(use-package! org-appear)
(use-package! org-ol-tree
  :commands org-ol-tree)

(setq org-directory "~/cloud/org/")
(setq org-agenda-files (list org-directory))
(add-hook! 'org-mode-hook #'visual-line-mode)

(after! org
  (setq org-todo-keywords '((sequence "TODO(t)" "NEXT(n)" "WAITING(w)" "ONHOLD(h)" "|" "DONE(d)")
                            (sequence "EMAIL(e)" "|" "SENT(s)")
                            (sequence "|" "CANCELLED(c)")
                            (sequence "|" "MOVED(m)")))
  (setq org-log-done 'time
        org-list-allow-alphabetical t
        org-catch-invisible-edits t
        org-enforce-todo-dependencies t
        org-return-follows-link t
        org-fontify-quote-and-verse-blocks nil
        org-fontify-whole-heading-line nil
        org-highlight-latex-and-related '(native script entities)
        org-startup-with-latex-preview nil
        org-startup-with-inline-images nil))

(use-package! org-modern
  :hook (org-mode . org-modern-mode)
  :config
  (setq org-modern-star '("◉" "○" "✸" "✿" "✤" "✜" "◆" "▶")
        org-modern-table-vertical 1
        org-modern-table-horizontal 0.2
        org-modern-list '((43 . "➤") (45 . "–") (42 . "•"))
        org-modern-todo-faces
        '(("TODO" :inverse-video t :inherit org-todo)
          ("PROJ" :inverse-video t :inherit +org-todo-project)
          ("STRT" :inverse-video t :inherit +org-todo-active)
          ("WAIT" :inverse-video t :inherit +org-todo-onhold)
          ("DONE" :inverse-video t :inherit org-done))
        org-modern-block-fringe nil))

(use-package! org-appear
  :hook (org-mode . org-appear-mode)
  :config
  (setq org-appear-autoemphasis t
        org-appear-autosubmarkers t))

(custom-set-faces!
  '(outline-1 :weight extra-bold :height 1.25)
  '(outline-2 :weight bold :height 1.15)
  '(outline-3 :weight bold :height 1.12)
  '(org-document-title :height 1.2))

(use-package! org-super-agenda
  :commands org-super-agenda-mode)

(after! org-agenda
  (org-super-agenda-mode)
  (setq org-agenda-skip-scheduled-if-done t
        org-agenda-skip-deadline-if-done t
        org-agenda-include-deadlines t
        org-agenda-block-separator nil
        org-agenda-tags-column 100
        org-agenda-compact-blocks t))

;; Custom Commands
(setq org-agenda-custom-commands
      '(("o" "Overview"
         ((agenda "" ((org-agenda-span 'day)
                      (org-super-agenda-groups
                       '((:name "Today" :time-grid t :date today :todo "TODAY" :scheduled today :order 1)))))
          (alltodo "" ((org-agenda-overriding-header "")
                       (org-super-agenda-groups
                        '((:name "Next to do" :todo "NEXT" :order 1)
                          (:name "Important" :tag "Important" :priority "A" :order 6)
                          (:name "Due Today" :deadline today :order 2)
                          (:name "Due Soon" :deadline future :order 8)
                          (:name "Overdue" :deadline past :face error :order 7)
                          (:name "Projects" :tag "Project" :order 14)
                          (:name "Waiting" :todo "WAITING" :order 20)
                          (:discard (:tag ("Chore" "Routine" "Daily")))))))))))

(use-package! doct :commands doct)

(after! org-capture
  (defvar +org-capture-todo-file (concat org-directory "todo.org"))
  (defvar +org-capture-notes-file (concat org-directory "notes.org"))

  (setq org-capture-templates
        (doct `(("Personal todo" :keys "t"
                 :icon ("nf-oct-checklist" :set "octicon" :color "green")
                 :file +org-capture-todo-file
                 :prepend t
                 :headline "Inbox"
                 :type entry
                 :template ("* TODO %?" "%i %a"))
                ("Personal note" :keys "n"
                 :icon ("nf-fa-sticky_note_o" :set "faicon" :color "green")
                 :file +org-capture-notes-file
                 :prepend t
                 :headline "Inbox"
                 :type entry
                 :template ("* %?" "%i %a"))
                ("Email" :keys "e"
                 :icon ("nf-fa-envelope" :set "faicon" :color "blue")
                 :file +org-capture-todo-file
                 :prepend t
                 :headline "Inbox"
                 :type entry
                 :template ("* TODO %^{type|reply to|contact} %\\3 %? :email:"
                            "Send an email to %^{recipiant}"
                            "%U %i %a"))))))

(setq org-roam-directory (concat (file-name-as-directory org-directory) "Notes/"))
(setq org-roam-db-location (concat doom-cache-dir "org-roam.db"))
(setq org-roam-db-update-method 'immediate)

(use-package org-roam-ui
  :after org-roam
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start nil))

(setq org-roam-dailies-capture-templates
      '(("d" "default" entry "* %?"
         :if-new (file+head
                  "%<%Y-%m-%d>.org"
                  "#+title: %<%Y-%m-%d>\n")
         :unnarrowed t
         :immediate-finish t
         :jump-to-captured t)))

(after! org-roam
  (setq org-roam-capture-templates
        '(("d" "default" plain "%?"
           :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                              "#+title: ${title}\n#+date: %U\n#+filetags:\n\n")
           :unnarrowed t)
          ("r" "reference" plain "%?"
           :target (file+head "references/%<%Y%m%d%H%M%S>-${slug}.org"
                              "#+title: ${title}\n#+date: %U\n#+filetags: :reference:\n\n* Source\n\n* Notes\n")
           :unnarrowed t)
          ("p" "project" plain "%?"
           :target (file+head "projects/%<%Y%m%d%H%M%S>-${slug}.org"
                              "#+title: ${title}\n#+date: %U\n#+filetags: :project:\n\n* Goals\n\n* Tasks\n\n* Notes\n")
           :unnarrowed t))))

(after! org
  (add-to-list 'org-modules 'org-habit t)
  (setq org-habit-show-habits t
        org-habit-show-habits-only-for-today t
        org-habit-graph-column 60
        org-habit-preceding-days 21
        org-habit-following-days 7))

(after! citar
