.config/doom/config.el
  (setq citar-bibliography (list (concat org-directory "references.bib"))
        citar-notes-paths (list (concat org-roam-directory "references/"))
        citar-library-paths (list "~/Documents/papers/")
        org-cite-global-bibliography citar-bibliography
        org-cite-insert-processor 'citar
        org-cite-follow-processor 'citar
        org-cite-activate-processor 'citar))

(after! org
  (setq org-export-headline-levels 5
        org-export-with-toc t
        org-export-with-section-numbers nil
        org-export-with-smart-quotes t))

(after! ox-html
  (setq org-html-validation-link nil
        org-html-head-include-scripts nil
        org-html-head-include-default-style nil
        org-html-doctype "html5"
        org-html-html5-fancy t))

(after! org-journal
  (setq org-journal-dir (concat org-directory "journal/")
        org-journal-date-prefix "#+title: "
        org-journal-time-prefix "* "
        org-journal-date-format "%Y-%m-%d %A"
        org-journal-file-format "%Y-%m-%d.org"
        org-journal-enable-agenda-integration t))

(map! :leader
      :prefix ("j" . "journal")
      "j" #'org-journal-new-entry
      "s" #'org-journal-search)

(after! writeroom-mode
  (setq writeroom-width 100
        writeroom-mode-line t
        writeroom-global-effects '(writeroom-set-fullscreen
                                   writeroom-set-alpha
                                   writeroom-set-menu-bar-lines
                                   writeroom-set-tool-bar-lines
                                   writeroom-set-vertical-scroll-bars
                                   writeroom-set-bottom-divider-width)))

(after! dirvish
  (setq dirvish-quick-access-entries
        '(("h" "~/"                          "Home")
          ("d" "~/Downloads/"                "Downloads")
          ("c" "~/Code/"                     "Code")
          ("o" "~/cloud/org/"                "Org")
          ("p" "~/Pictures/"                 "Pictures")
          ("t" "/tmp/"                       "Temp")))
  (dirvish-override-dired-mode))

(after! dired
  (setq dired-dwim-target t
        dired-recursive-copies 'always
        dired-recursive-deletes 'always
        delete-by-moving-to-trash t))

(after! pdf-view
  (setq pdf-view-display-size 'fit-page
        pdf-view-resize-factor 1.1
        pdf-annot-activate-created-annotations t)
  (add-hook! 'pdf-view-mode-hook #'pdf-view-midnight-minor-mode))

(use-package! ebib
  :commands ebib
  :config
  (setq ebib-preload-bib-files (list (concat org-directory "references.bib"))
        ebib-notes-directory (concat org-roam-directory "references/")
        ebib-file-associations '(("pdf" . "xdg-open"))
        ebib-index-columns '(("Entry Key" 20 t)
                            ("Author/Editor" 40 t)
                            ("Year" 6 t)
                            ("Title" 60 t))
        ebib-reading-list-file (concat org-directory "reading-list.org")))

(after! consult
  (setq consult-narrow-key "<"
        consult-preview-key "M-."))

(map! :leader
      "s g" #'consult-ripgrep
      "s l" #'consult-line
      "s o" #'consult-outline
      "s i" #'consult-imenu)

(use-package! gptel
  :commands gptel gptel-send gptel-menu
  :config
  (setq gptel-model 'claude-sonnet-4-20250514
        gptel-backend (gptel-make-anthropic "Claude"
                        :stream t
                        :key #'gptel-api-key-from-auth-source))
  (setq gptel-default-mode 'org-mode))

(map! :leader
      :prefix ("l" . "LLM")
      "l" #'gptel
      "s" #'gptel-send
      "m" #'gptel-menu)

(use-package! org-pomodoro
  :commands org-pomodoro
  :config
  (setq org-pomodoro-length 25
        org-pomodoro-short-break-length 5
        org-pomodoro-long-break-length 20
        org-pomodoro-long-break-frequency 4
        org-pomodoro-play-sounds t
        org-pomodoro-keep-killed-pomodoro-time t))

(map! :after org-agenda
      :map org-agenda-mode-map
      "P" #'org-pomodoro)

(defun my-doom-dashboard-draw-ascii-banner-fn ()
  (let* ((banner '("███████╗███╗   ███╗ █████╗  ██████╗███████╗"
                   "██╔════╝████╗ ████║██╔══██╗██╔════╝██╔════╝"
                   "█████╗  ██╔████╔██║███████║██║     ███████╗"
                   "██╔══╝  ██║╚██╔╝██║██╔══██║██║     ╚════██║"
                   "███████╗██║ ╚═╝ ██║██║  ██║╚██████╗███████║"
                   "╚══════╝╚═╝     ╚═╝╚═╝  ╚═╝ ╚═════╝╚══════╝"))
         (longest-line (apply #'max (mapcar #'length banner))))
    (put-text-property
     (point)
     (dolist (line banner (point))
       (insert (+doom-dashboard--center
                +doom-dashboard--width
                (concat line
                        (make-string (max 0 (- longest-line (length line))) ?\s)))
               "\n"))
     'face 'doom-dashboard-banner)))

(setq +doom-dashboard-ascii-banner-fn #'my-doom-dashboard-draw-ascii-banner-fn)

(map! :leader
      :desc "Elfeed" "o e" #'elfeed)

(setq +doom-dashboard-menu-sections
      '(("Open org-agenda"
         :icon (nerd-icons-octicon "nf-oct-calendar" :face 'doom-dashboard-menu-title)
         :when (fboundp 'org-agenda)
         :face (:inherit (doom-dashboard-menu-title bold))
         :key "SPC o A"
         :action org-agenda)
        ("Open elfeed"
         :icon (nerd-icons-faicon "nf-fa-rss" :face 'doom-dashboard-menu-title)
         :when (fboundp 'elfeed)
         :face (:inherit (doom-dashboard-menu-title bold))
         :key "SPC o e"
         :action elfeed)
        ("Open mu4e"
         :icon (nerd-icons-mdicon "nf-md-email" :face 'doom-dashboard-menu-title)
         :when (fboundp 'mu4e)
         :face (:inherit (doom-dashboard-menu-title bold))
         :key "SPC o m"
         :action mu4e)
        ("Recently opened files"
         :icon (nerd-icons-faicon "nf-fa-file_text" :face 'doom-dashboard-menu-title)
         :face (:inherit (doom-dashboard-menu-title bold))
         :key "SPC f r"
         :action recentf-open-files)
        ("Open project"
         :icon (nerd-icons-octicon "nf-oct-briefcase" :face 'doom-dashboard-menu-title)
         :face (:inherit (doom-dashboard-menu-title bold))
         :key "SPC p p"
         :action projectile-switch-project)
        ("Open private configuration"
         :icon (nerd-icons-octicon "nf-oct-gear" :face 'doom-dashboard-menu-title)
         :when (file-directory-p doom-private-dir)
         :face (:inherit (doom-dashboard-menu-title bold))
         :key "SPC f p"
         :action doom/open-private-config)))
